AbderrhmanAbdellatif/STM32F407GVX/cubemex mislemci projects/odev2ma/Src/main.c
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
	int durum;

void ledYak(){

	switch (durum){
		case 0 :
			HAL_GPIO_WritePin(GPIOD, G_Pin ,GPIO_PIN_RESET);	
	HAL_GPIO_WritePin(GPIOD, A_Pin| B_Pin|C_Pin|D_Pin|E_Pin|F_Pin,GPIO_PIN_SET);	
		break;
		case 1:
				 HAL_GPIO_WritePin(GPIOD, B_Pin|C_Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOD,  A_Pin| D_Pin|G_Pin|E_Pin|F_Pin,GPIO_PIN_RESET);	
		break;
		case 2:
				 HAL_GPIO_WritePin(GPIOD,  A_Pin| B_Pin|D_Pin|E_Pin|G_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD, C_Pin|F_Pin,GPIO_PIN_RESET);	
		break;
		case 3:
				 HAL_GPIO_WritePin(GPIOD,  A_Pin| B_Pin|C_Pin|D_Pin|G_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD, E_Pin|F_Pin,GPIO_PIN_RESET);	
		break;
		case 4:
				 HAL_GPIO_WritePin(GPIOD,  A_Pin| D_Pin|E_Pin,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, B_Pin|C_Pin|G_Pin|F_Pin,GPIO_PIN_SET);	
		break;
		case 5:
				 HAL_GPIO_WritePin(GPIOD,  A_Pin|C_Pin|D_Pin|G_Pin|F_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD,  B_Pin|E_Pin,GPIO_PIN_RESET);	
		break;
		case 6:
				 HAL_GPIO_WritePin(GPIOD,  A_Pin| C_Pin|D_Pin|E_Pin|F_Pin|G_Pin ,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD,B_Pin,GPIO_PIN_RESET);	
		break;
		case 7:
				 HAL_GPIO_WritePin(GPIOD,  A_Pin| B_Pin|C_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD, G_Pin|D_Pin|E_Pin|F_Pin,GPIO_PIN_RESET);	
		break;
		case 8:
				 HAL_GPIO_WritePin(GPIOD,  A_Pin| B_Pin|C_Pin|D_Pin|E_Pin|F_Pin|G_Pin,GPIO_PIN_SET);
	
		break;
		case 9:
				 HAL_GPIO_WritePin(GPIOD, A_Pin| B_Pin|C_Pin|G_Pin|F_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD, D_Pin|E_Pin,GPIO_PIN_RESET);	
		break;
		default:
			HAL_GPIO_WritePin(GPIOD,  A_Pin| B_Pin|C_Pin|D_Pin|E_Pin|F_Pin|G_Pin,GPIO_PIN_RESET);	
		break;
	}
	
}
void EXTI0_IRQHandler(void)
{
  /* USER CODE BEGIN EXTI0_IRQn 0 */

  /* USER CODE END EXTI0_IRQn 0 */
	/* soru1
	 HAL_GPIO_TogglePin(GPIOD, led1_Pin|led2_Pin|led3_Pin|led4_Pin);
	 for(int i=0;i<1000;i++);
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);*/
  /* USER CODE BEGIN EXTI0_IRQn 1 */
	
	
	durum++;
	if(durum>9){
	//	HAL_Delay(100);
	
		durum=0;
	}

	   ledYak();
		// for(int i=0;i<1000;i++);
		 for(int i=0;i<1000000;i++);
	   HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
	
  /* USER CODE END EXTI0_IRQn 1 */
}


int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, A_Pin|B_Pin|C_Pin|D_Pin 
                          |E_Pin|F_Pin|G_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : button_Pin */
  GPIO_InitStruct.Pin = button_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(button_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : A_Pin B_Pin C_Pin D_Pin 
                           E_Pin F_Pin G_Pin */
  GPIO_InitStruct.Pin = A_Pin|B_Pin|C_Pin|D_Pin 
                          |E_Pin|F_Pin|G_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
